[
    {
        "id": 1,
        "name": "Introduction to C Programming",
        "image": "https://i.ibb.co/ZJDV3vc/Rectangle-2-2.png",
        "credit": 1,
        "price":  15000,
        "details": "C is a general-purpose, procedural programming language developed in the early 1970s at Bell Labs by Dennis Ritchie. It is one of the most influential programming languages."
    },
    {
        "id": 2,
        "name": "Introduction to Algorithms",
        "image": "https://i.ibb.co/gj7HsnC/Rectangle-2-3.png",
        "credit": 2,
        "price":  25000,
        "details": "Introduction to Algorithms is considered a fundamental and comprehensive resource for learning about algorithms and their applications.It provides various algorithmic techniques."
    },
    {
        "id": 3,
        "name": "Introduction to C++ for DSA",
        "image": "https://i.ibb.co/VwCHXDD/Rectangle-2-4.png",
        "credit": 10,
        "price":  10000,
        "details": "The course aims to introduce students to the C++ programming language and how it can be applied in the field of Data Structures and Algorithms."
    },
    {
        "id": 4,
        "name": "Basic Data Structures",
        "image": "https://i.ibb.co/wL38GBF/Rectangle-3.png",
        "credit": 5,
        "price":  35000,
        "details": "Basic data structures are fundamental building blocks in computer science and programming. It contains such as arrays, linked lists, stacks, queues, trees, graphs, and hash table."
    },
    {
        "id": 5,
        "name": "Introduction to OOP Python",
        "image": "https://i.ibb.co/ZHhgDbH/Rectangle-2.png",
        "credit": 5,
        "price":  19000,
        "details": "(OOP) in Python is a fundamental topic in Python programming. Python is a multi-paradigm programming language, and OOP is one of its primary paradigms."
    },
    {
        "id": 6,
        "name": "Software Engineering",
        "image": "https://i.ibb.co/CwG80zj/Rectangle-2-5.png",
        "credit": 2,
        "price":  23000,
        "details": "Software engineering is a multidisciplinary field that focuses on the design, development, testing, maintenance, and management of software systems."
    },
    {
        "id": 7,
        "name": "AWS, Cloud Computing",
        "image": "https://i.ibb.co/P4Zg0Zx/Rectangle-3-1.png",
        "credit": 5,
        "price":  35000,
        "details": "Amazon Web Services (AWS) is a leading cloud computing platform and a subsidiary of Amazon.com. It offers a wide range of cloud computing services in IT infrastructure."
    },
    {
        "id": 8,
        "name": "Database (MySQL)",
        "image": "https://i.ibb.co/X3GyQy5/Rectangle-2-1.png",
        "credit": 5,
        "price":  19000,
        "details": "MySQL is a widely used relational database management system (RDBMS) that is open-source and known for its speed, reliability, and ease of use."
    },
    {
        "id": 9,
        "name": "Problem-Solving Part",
        "image": "https://i.ibb.co/ZHBTZBn/Rectangle-2-6.png",
        "credit": 2,
        "price":  23000,
        "details": "Problem-solving is a critical aspect of many fields, including mathematics, computer science, engineering, business, and everyday life. It refers to the process of finding solutions."
    }
]